pipeShellThermal/buoyantBoussinesqSimpleFoam/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// options
// {
//     heatingSource1
//     {
//         type            scalarSemiImplicitSource;

//         selectionMode   all;

//         volumeMode      specific;
//         injectionRateSuSp
//         {
//             T     (1e8 0); 
//         }
//     }
// }


// ************************************************************************* //
